---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.LineSpringCoefficient
source: html/fcd30d2c-c23b-b964-562b-84dab4aa9e9a.htm
---
# Autodesk.Revit.DB.SpecTypeId.LineSpringCoefficient Property

Line Spring Coefficient, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId LineSpringCoefficient { get; }
```